МастерНаВсеРуки/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МастерНаВсеРуки/src/Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Сообщить("ПередЗаписьюНаСервере");
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Сообщить("ОбработкаПроверкиЗаполненияНаСервере");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//TODO: Вставить содержимое обработчика
	Сообщить("ПередЗаписью");
КонецПроцедуры
&НаСервере
Процедура ПроцедураНаСервере()
	 
	 а = 1;
	ДокОбъект = РеквизитФормыВЗначение("Объект")
КонецПроцедуры


&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
	ТекСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекСтрока.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, ТекСтрока.Материал);
	ПроцедураНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиент.РассчитатьСумму(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	
	
	РаботаСДокументамиКлиент.РассчитатьСумму(Элементы.Материалы.ТекущиеДанные);
	
КонецПроцедуры
